src/AccumulationRegisters/MutualSettlements.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<AccumulationRegister>
		<Properties>
			<Name>MutualSettlements</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Comment>Debts of the company</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Counterparty</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Counterparties</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/MutualSettlements/Forms/CurrentMutualSettlements/Ext/Form/Module.bsl
&AtServer
Procedure Fill()
	Query = New Query("SELECT
	                      |	MutualSettlementsBalance.Counterparty,
	                      |	MutualSettlementsBalance.Currency,
	                      |	MutualSettlementsBalance.AmountBalance AS AmountBalance
	                      |FROM
	                      |	AccumulationRegister.MutualSettlements.Balance AS MutualSettlementsBalance
	                      |AUTOORDER");
	Selection = Query.Execute().Select();
	While Selection.Next() Do
		NewRow = BalanceTable.Add();
		NewRow.Counterparty = Selection.Counterparty;
		NewRow.Currency = Selection.Currency;
		If Selection.AmountBalance > 0 Then
			NewRow.CompanyAccountsPayable = Selection.AmountBalance;
		Else
			NewRow.CompanyAccountsReceivable = Selection.AmountBalance * -1;
		EndIf;	
	EndDo;
	
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	Fill();
EndProcedure

&AtClient
Procedure BalanceTableChoice(Item, SelectedRow, Field, StandardProcessing)
	ShowValue(, BalanceTable.FindByID(SelectedRow).Counterparty);
	StandardProcessing = False;
EndProcedure

&AtClient
Procedure RefreshExecute()
	BalanceTable.Clear();
	Fill();
EndProcedure
